itin/test_data/psngr_details_rq.xml

<soap-env:Envelope 
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" 
    xmlns:xlink="http://www.w3.org/2001/xlink" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap-env:Header>
        <eb:MessageHeader soap-env:mustUnderstand="1" eb:version="2.0.0">
            <eb:From>
                <eb:PartyId type="urn:x12.org:IO5:01">z.com</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId>
            </eb:To>
            <eb:CPAId>ABCD1</eb:CPAId>
            <eb:ConversationId>fds8789h|dev@z.com</eb:ConversationId>
            <eb:Service eb:type="sabreXML">PassengerDetailsRQ</eb:Service>
            <eb:Action>PassengerDetailsRQ</eb:Action>
            <eb:MessageData>
                <eb:MessageId>mid:20180216-07:18:42.3|14oUa</eb:MessageId>
                <eb:Timestamp>2018-05-25T19:29:20Z</eb:Timestamp>
            </eb:MessageData>
        </eb:MessageHeader>
        <wsse:Security 
            xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" 
            xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
            <wsse:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESD!ICESMSLB\/RES.LB!-3142912682934961782!1421699!0</wsse:BinarySecurityToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <PassengerDetailsRQ 
            xmlns="http://services.sabre.com/sp/pd/v3_3" version="3.3.0" IgnoreOnError="false" HaltOnError="false">
            <PostProcessing IgnoreAfter="false" RedisplayReservation="true" UnmaskCreditCard="false"></PostProcessing>
            <PreProcessing IgnoreBefore="true"></PreProcessing>
            <TravelItineraryAddInfoRQ>
                <CustomerInfo>
                    <ContactNumbers>
                        <ContactNumber NameNumber="1.1" Phone="835-734-6758" PhoneUseType="H"></ContactNumber>
                    </ContactNumbers>
                    <PersonName NameNumber="1.1" NameReference="ABC123" PassengerType="ADT">
                        <GivenName>Charles</GivenName>
                        <Surname>Babbage</Surname>
                    </PersonName>
                </CustomerInfo>
            </TravelItineraryAddInfoRQ>
        </PassengerDetailsRQ>
    </soap-env:Body>
</soap-env:Envelope>